УТ/src/Catalogs/CRM_ВнешниеБиблиотеки/CRM_ВнешниеБиблиотеки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ВнешниеБиблиотеки</name>
  <predefined>
    <items>
      <name>БиблиотекаОтображенияГрафиков</name>
      <description>Библиотека отображения графиков (d3.js)</description>
    </items>
    <items>
      <name>БиблиотекаОтображенияГрафиковLinux</name>
      <description>Библиотека отображения графиков для ОС Linux (d3.js)</description>
    </items>
  </predefined>
  <attributes>
    <name>БиблиотекаСовместимости</name>
    <type>
      <types>CatalogRef.CRM_ВнешниеБиблиотеки</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМакетаВерсии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерБиблиотеки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеАрхиваБиблиотеки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеБиблиотеки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_ВнешниеБиблиотеки/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	//////////////////////////////////////////////
	// Заполнение хранилищ объекта.
	
	Если ЗначениеЗаполнено(ЭтотОбъект.НаименованиеМакетаВерсии) Тогда
		ДвоичныеДанныеАрхиваБиблиотеки = Справочники.CRM_ВнешниеБиблиотеки.ПолучитьМакет(
			ЭтотОбъект.НаименованиеМакетаВерсии);
		
		ЭтотОбъект.ХранилищеАрхиваБиблиотеки = Новый ХранилищеЗначения(ДвоичныеДанныеАрхиваБиблиотеки);
	Иначе
		ДвоичныеДанныеАрхиваБиблиотеки = ЭтотОбъект.ХранилищеАрхиваБиблиотеки.Получить();
	КонецЕсли;
	
	Если ДвоичныеДанныеАрхиваБиблиотеки = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ZipФайл = Новый ЧтениеZipФайла(ДвоичныеДанныеАрхиваБиблиотеки.ОткрытьПотокДляЧтения());
	
	Если ZipФайл.Элементы.Количество() = 0 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	КаталогВременныхФайлов = КаталогВременныхФайлов();
	
	ПутьКРаспакованномуФайлу = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогВременныхФайлов)
		+ ZipФайл.Элементы[0].Имя;
	
	ZipФайл.Извлечь(ZipФайл.Элементы[0], КаталогВременныхФайлов());
	
	ДвоичныеДанныеРаспакованногоФайла = Новый ДвоичныеДанные(ПутьКРаспакованномуФайлу);
	ЭтотОбъект.ХранилищеБиблиотеки = Новый ХранилищеЗначения(ДвоичныеДанныеРаспакованногоФайла);
	
	ЭтотОбъект.РазмерБиблиотеки = ДвоичныеДанныеРаспакованногоФайла.Размер();
	ЭтотОбъект.КонтрольнаяСумма = CRM_РаботаСВнешнимиБиблиотекамиВызовСервера.КонтрольнаяСуммаСтрокой(
		ДвоичныеДанныеРаспакованногоФайла);
	
	//////////////////////////////////////////////
	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#Иначе

ВызватьИсключение НСтр(
	"ru = 'Недопустимый вызов объекта на клиенте.';
	|en = 'Invalid object call on the client.'");

#КонецЕсли
